cask_args appdir: '/Applications'

tap 'Goles/battery'
tap 'railwaycat/emacsmacport'

# Regular homebrew apps
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'battery'
brew 'chruby'
#brew 'coreutils' # broken in macOS Sierra
brew 'elixir'
#brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick']
brew 'exiftool'
brew 'forego'
brew 'gettext'
brew 'gnupg'
brew 'gnupg2'
brew 'git'
brew 'glib'
brew 'go'
brew 'gpg-agent'
brew 'heroku'
brew 'htop-osx'
brew 'isync'
brew 'jq'
brew 'leiningen'
brew 'libffi'
brew 'msmtp'
brew 'mutt', args: ['with-confirm-attachment-patch', 'with-gpgme', 'with-s-lang']
brew 'nmap'
brew 'node-build'
brew 'nodenv'
brew 'openssl'
brew 'packer'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'pstree'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'shellcheck'
brew 'stow'
brew 'terraform'
brew 'the_platinum_searcher'
brew 'tmux'
brew 'tree'
brew 'urlview'
brew 'watch'
brew 'xz'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# OS X apps via homebrew cask
#cask 'alfred' # broken in macOS Sierra
cask 'aws-vault'
cask 'docker'
cask 'emacs-mac'
cask 'google-chrome'
cask 'istat-menus'
cask 'licecap'
cask 'monodraw'
#cask 'sizeup' # broken in macOS Sierra
cask 'sketch'
cask 'sonos'
cask 'things'
cask 'vlc'

# Mac App Store apps
#brew 'mas'
#mas '1Password', id: 443987910
#mas 'Caffeine', id: 411246225
#mas 'Dash', id: 458034879
#mas 'iA Writer', id: 439623248
#mas 'Monosnap', id: 540348655
#mas 'Patterns', id: 429449079
#mas 'Pixelmator', id: 407963104
#mas 'Pixen', id: 525180431
#mas 'Quiver', id: 866773894
#mas 'Slack', id: 803453959
#mas 'Tweetbot', id: 557168941
#mas 'WiFi Explorer', id: 494803304
#
